### EDA (Exploratory Data Analysis):

To know about basic functions of Dict, List and some of Pandas libray functions.
To eliminate null values from dataframe 
To replace nan values to mean, median values of column

In [138]:
# Example of list object: 

dog = ['Freddie', 9 , True, ['bone', 'little cat']]
dog

['Freddie', 9, True, ['bone', 'little cat']]

To test the basic function of Dictionary: len, .keys, .values

In [2]:
#Passing dictonaries with keys and {}.

dog_dict = {'name': 'Simon', 'age': 5, 'is vacinated': True, 'height': 1,'belongings':['bone' ,'little ball' ]}
dog_dict

{'name': 'Simon',
 'age': 5,
 'is vacinated': True,
 'height': 1,
 'belongings': ['bone', 'little ball']}

In [3]:
# To get all keys.

dog_dict.keys()

dict_keys(['name', 'age', 'is vacinated', 'height', 'belongings'])

In [4]:
# To get values

dog_dict.values()

dict_values(['Simon', 5, True, 1, ['bone', 'little ball']])

In [8]:
len(dog_dict)

5

In [13]:
dog_dict['height']

1

To test the pliting on 'test1' string.

In [24]:
test1 = '0123456789'
test1

'0123456789'

In [25]:
test1[1::]

'123456789'

In [26]:
test1[-1::]

'9'

In [27]:
test1[:1:]

'0'

In [28]:
test1[:-1:]

'012345678'

In [29]:
test1[::1]

'0123456789'

In [30]:
test1[::-1]

'9876543210'

In [31]:
test1[::-2]

'97531'

In [33]:
test1[:3]

'012'

In [34]:
test1[1:4]

'123'

In [41]:
test1[-1:-4:-1]

'987'

Reshaping of array:

In [47]:
import numpy as np
x = np.array([[8,9,10],[5,6,7]])  #2*3 matrix
np.reshape(x,(3,2))

array([[ 8,  9],
       [10,  5],
       [ 6,  7]])

In [48]:
np.reshape(x,(1,6))

array([[ 8,  9, 10,  5,  6,  7]])

### Some pandas library functions:

In [49]:
import pandas as pd
df = pd.read_csv('employees.csv')
df.head()

  First Name  Gender  Salary Bonus % Senior Management             Team
0    Douglas    Male   97308   6.945              TRUE        Marketing
1     Thomas    Male   61933     NaN              TRUE              NaN
2      Maria  Female  130590  11.858             FALSE          Finance
3      Jerry    Male     NaN    9.34              TRUE          Finance
4      Larry    Male  101004   1.389              TRUE  Client Services

In [50]:
df.shape

(1000, 6)

In [51]:
df.columns

Index(['First Name', 'Gender', 'Salary', 'Bonus %', 'Senior Management',
       'Team'],
      dtype='object')

In [52]:
df.isnull().sum()

First Name            69
Gender               148
Salary                 2
Bonus %                3
Senior Management     68
Team                  43
dtype: int64

In [53]:
df.isnull().sum().sum()

333

In [128]:
#function to do primary things with data.

def eda(x):
    print(x.head())
    print("\nshape: ", x.shape)
    print("\nnull values: ", x.isnull().sum())
    print('\ntotal null objecets: ', x.isnull().sum().sum())
    print("\ncolumns of datafame: ", x.columns)

In [129]:
eda(df)

  First Name  Gender  Salary  Bonus % Senior Management             Team
0    Douglas    Male   97308    6.945              TRUE        Marketing
1     Thomas    Male   61933      NaN              TRUE              NaN
2      Maria  Female  130590   11.858             FALSE          Finance
3      Jerry    Male     NaN    9.340              TRUE          Finance
4      Larry    Male  101004    1.389              TRUE  Client Services

shape:  (1000, 6)

null values:  First Name            70
Gender               148
Salary                 4
Bonus %                4
Senior Management     69
Team                  47
dtype: int64

total null objecets:  342

columns of datafame:  Index(['First Name', 'Gender', 'Salary', 'Bonus %', 'Senior Management',
       'Team'],
      dtype='object')

In [78]:
df['Gender'].unique()
##get four unique dataset in database.

array(['Male', 'Female', 'n.a.', nan], dtype=object)

In [80]:
#df['Bonus %'].unique()
#  we should need to do some other operations
type(df['Bonus %'])

pandas.core.series.Series

In [81]:
df['Bonus %'].dtype

dtype('float64')

In [82]:
df['Senior Management'].unique()

array(['TRUE', 'FALSE', nan, 'n.a.'], dtype=object)

In [84]:
df['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution', 'n.a.'], dtype=object)

In [98]:
df.head()

  First Name  Gender  Salary  Bonus % Senior Management             Team
0    Douglas    Male   97308    6.945              TRUE        Marketing
1     Thomas    Male   61933      NaN              TRUE              NaN
2      Maria  Female  130590   11.858             FALSE          Finance
3      Jerry    Male     NaN    9.340              TRUE          Finance
4      Larry    Male  101004    1.389              TRUE  Client Services

In [106]:
df[::2].head(5)

  First Name  Gender  Salary  Bonus % Senior Management             Team
0    Douglas    Male   97308    6.945              TRUE        Marketing
2      Maria  Female  130590   11.858             FALSE          Finance
4      Larry    Male  101004    1.389              TRUE  Client Services
6       Ruby  Female   65476   10.012              TRUE          Product
8     Angela     NaN     NaN   18.523              TRUE      Engineering

In [112]:
df.tail(3)

    First Name Gender  Salary  Bonus % Senior Management                  Team
997    Russell   Male   96914    1.421             FALSE               Product
998      Larry   Male   60500   11.985             FALSE  Business Development
999     Albert   Male  129949   10.169              TRUE                 Sales

To use of drop function.

In [123]:
x = df.drop(['Gender','Team'], axis = 1).tail(4)

In [127]:
y = x.drop(['Salary'],axis = 1)
y.head()

    First Name  Bonus % Senior Management
996    Phillip   19.675             FALSE
997    Russell    1.421             FALSE
998      Larry   11.985             FALSE
999     Albert   10.169              TRUE

To check null values in dataframe

In [131]:
import pandas as pd

df1 = pd.read_csv('employees.csv')
missing =  ["n/a", "na", "--","?","n.a."]
df1 = pd.read_csv('employees.csv', na_values = missing)
df1.head()

  First Name  Gender    Salary  Bonus % Senior Management             Team
0    Douglas    Male   97308.0    6.945              True        Marketing
1     Thomas    Male   61933.0      NaN              True              NaN
2      Maria  Female  130590.0   11.858             False          Finance
3      Jerry    Male       NaN    9.340              True          Finance
4      Larry    Male  101004.0    1.389              True  Client Services

In [134]:
df1.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [137]:
df1['Salary'].fillna(0, inplace = True)
df1.isnull().sum()
# Here salary columns became to zero.

First Name            70
Gender               149
Salary                 0
Bonus %                4
Senior Management     71
Team                  48
dtype: int64